.doom.d/config.org
** TODO Notmuch - Email Client
#+BEGIN_SRC elisp
;define function that syncs mbsync and refreshes notmuch
(defun jf/sync-email ()
  "Lists the contents of the current directory."
  (interactive)
  (shell-command "mbsync -a && notmuch new"))

; bind notmuch-hello view
(map! :n "SPC o n" #'notmuch-hello)
; bind custom function to sync mbsync and notmuch
(map! :n "SPC r s" 'jf/sync-email)

;; attempt to fix notmuch formatting
(setq notmuch-search-result-format
  '(("date" . "%12s ")
    ("count" . "%-6s ")
    ("authors" . "%-15s ")
    ("subject" . "%-10s ")
    ("tags" . "(%s)"))
)
(defun jf/establish-notmuch ()
  (interactive)
(setq notmuch-saved-searches '((:name "Personal"
                                :query "tag:inbox AND to:jonathanfung2000@gmail.com AND date:nov_3_2020..today AND NOT tag:delete")
                               (:name "UCI"
                                :query "tag:inbox AND to:fungjm@uci.edu AND date:nov_3_2020..today AND NOT tag:delete")
                               (:name "Clean Inbox"
                                :query "tag:inbox AND date:nov_3_2020..today")
                               (:name "Flagged"
                                :query "tag:inbox AND tag:flagged")
                               (:name "Inbox"
                                :query "tag:inbox"))))

(map! :n "SPC r e" 'jf/establish-notmuch)

; this sets cursor of notmuch-hellow to first saved search
(add-hook 'notmuch-hello-refresh-hook
          (lambda ()
            (if (and (eq (point) (point-min))
                     (search-forward "Saved searches:" nil t))
                (progn
                  (forward-line)
                  (widget-forward 1))
              (if (eq (widget-type (widget-at)) 'editable-field)
                  (beginning-of-line)))))

(setq notmuch-hello-sections '(notmuch-hello-insert-saved-searches))
#+END_SRC

#+RESULTS:
| notmuch-hello-insert-saved-searches |

* Programming
** TODO LSP
#+BEGIN_SRC elisp :results none
; Rust
(setq lsp-rust-server "rust-analyzer")
(map! :n "SPC t u" #'lsp-ui-doc-mode)

;; (setq lsp-disabled-clients '(rls))
#+END_SRC
* Emacsclient
** Workspace + emacsclient
Stops new emacsclient frames from creating new workspaces
#+BEGIN_SRC elisp :results none
(after! persp-mode
(setq persp-emacsclient-init-frame-behaviour-override "main"))
#+END_SRC
** TODO Initial Buffer
#+begin_src elisp
;; (setq initial-buffer-choice t)
#+end_src

#+RESULTS:
: t

* STRT Packages to Look At
** STRT Transclusion
https://github.com/nobiot/org-transclusion
** STRT Annotate
#+BEGIN_SRC elisp
;(annotate-mode)
#+END_SRC
** STRT Elgantt
#+BEGIN_SRC elisp :results none
;; enable elgantt - https://github.com/legalnonsense/elgantt/
;; (add-to-list 'load-path (concat user-emacs-directory "elgantt/")) ;; Or wherever it is located
;; (require 'elgantt)
#+END_SRC
* HOLD Packages Not Used Right Now
** HOLD header-line
#+BEGIN_SRC elisp
;; (defun toggle-header-line-format ()
;;     "Toggle buffer-local var header-line-format as pseudo-top margin"
;;     (setq header-line-format (if (eq header-line-format nil) t nil))
;;     (interactive)
;;     (redraw-display))
;; (global-set-key (kbd "<f6>") 'toggle-header-line-format)
; use with set-face-font header-line
;(set-face-background 'header-line "white")
#+END_SRC

#+RESULTS:

** HOLD Pandoc
Bind pdf-export in pandoc

Note: Deprecated in favor of [[Org Export - Latex]]
#+BEGIN_SRC elisp :results none
;(map! :n "SPC r r" #'pandoc-convert-to-pdf)
#+END_SRC
** HOLD Projectile
#+BEGIN_SRC elisp
; unbind SPC p F
;(map! :map doom-leader-map "p F" nil)
; rebind SPC p F to search all projects' files
;(map! :n "SPC p F" #'projectile-find-file-in-known-projects)
#+END_SRC

#+RESULTS:

** HOLD mu4e
#+BEGIN_SRC emacs-lisp :results none
;; (add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
;; ;; Each path is relative to `+mu4e-mu4e-mail-path', which is ~/.mail by default
;; (set-email-account! "Personal"
;;   '((mu4e-sent-folder       . "/gmail/[Gmail].Sent Mail")
;;     ;(mu4e-drafts-folder     . "/gmail/Drafts")
;;     (mu4e-trash-folder      . "/gmail/[Gmail].Trash")
;;     (mu4e-refile-folder     . "/gmail/[Gmail].All Mail")
;;     (smtpmail-smtp-user     . "jonathanfung2000@gmail.com")
;;     ;; (mu4e-compose-signature . "---\nHenrik Lissner"))
;;   t))
;; (set-email-account! "UCI"
;;   '((mu4e-sent-folder       . "/uci/[Gmail].Sent Mail")
;;     ;(mu4e-drafts-folder     . "/gmail/Drafts")
;;     (mu4e-trash-folder      . "/uci/[Gmail].Trash")
;;     (mu4e-refile-folder     . "/uci/[Gmail].All Mail")
;;     (smtpmail-smtp-user     . "fungjm@uci.edu")
;;     ;; (mu4e-compose-signature . "---\nHenrik Lissner"))
;;   t))
#+END_SRC
